RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DCU1">
            <name>DCU2</name>
            <description>desc DCU</description>
            <baseAddress>0x40056400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DUC_2</name>
                <description>DCU_2 interrupt</description>
                <value>45</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="DCU1">
            <name>DCU3</name>
            <description>desc DCU</description>
            <baseAddress>0x40056800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DCU_3</name>
                <description>DUC_3 interrupt</description>
                <value>46</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>DMA1</name>
            <description>desc DMA</description>
            <baseAddress>0x40053000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x238</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA1_Error</name>
                <description>DMA error interrupt</description>
                <value>32</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC0_BTC0</name>
                <description>DMA1 Transmission Complete 0 or Block Transmission Complete 0 interrupt</description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC1_BTC1</name>
                <description>DMA1 Transmission Complete 1 or Block Transmission Complete 1 interrupt</description>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC2_BTC2</name>
                <description>DMA1 Transmission Complete 2 or Block Transmission Complete 2 interrupt</description>
                <value>35</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC3_BTC3</name>
                <description>DMA1 Transmission Complete 3 or Block Transmission Complete 3 interrupt</description>
                <value>36</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC4_BTC4</name>
                <description>DMA1 Transmission Complete 4 or Block Transmission Complete 4 interrupt</description>
                <value>37</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC5_BTC5</name>
                <description>DMA1 Transmission Complete 5 or Block Transmission Complete 5 interrupt</description>
                <value>38</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC6_BTC6</name>
                <description>DMA1 Transmission Complete 6 or Block Transmission Complete 6 interrupt</description>
                <value>39</value>
            </interrupt>
            <interrupt>
                <name>DMA1_TC7_BTC7</name>
                <description>DMA1 Transmission Complete 7 or Block Transmission Complete 7 interrupt</description>
                <value>40</value>
            </interrupt>
            <registers>
                <register>
                    <name>EN</name>
                    <description>desc EN</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSTAT0</name>
                    <description>desc INTSTAT0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>TRNERR</name>
                            <description>desc TRNERR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REQERR</name>
                            <description>desc REQERR</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSTAT1</name>
                    <description>desc INTSTAT1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>TC</name>
                            <description>desc TC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BTC</name>
                            <description>desc BTC</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTMASK0</name>
                    <description>desc INTMASK0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>MSKTRNERR</name>
                            <description>desc MSKTRNERR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSKREQERR</name>
                            <description>desc MSKREQERR</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTMASK1</name>
                    <description>desc INTMASK1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>MSKTC</name>
                            <description>desc MSKTC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSKBTC</name>
                            <description>desc MSKBTC</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLR0</name>
                    <description>desc INTCLR0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>CLRTRNERR</name>
                            <description>desc CLRTRNERR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLRREQERR</name>
                            <description>desc CLRREQERR</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLR1</name>
                    <description>desc INTCLR1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>CLRTC</name>
                            <description>desc CLRTC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLRBTC</name>
                            <description>desc CLRBTC</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHEN</name>
                    <description>desc CHEN</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>desc CHEN</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REQSTAT</name>
                    <description>desc REQSTAT</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80FF</resetMask>
                    <fields>
                        <field>
                            <name>CHREQ</name>
                            <description>desc CHREQ</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCFGREQ</name>
                            <description>desc RCFGREQ</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSTAT</name>
                    <description>desc CHSTAT</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0003</resetMask>
                    <fields>
                        <field>
                            <name>DMAACT</name>
                            <description>desc DMAACT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCFGACT</name>
                            <description>desc RCFGACT</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHACT</name>
                            <description>desc CHACT</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCFGCTL</name>
                    <description>desc RCFGCTL</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F0F03</resetMask>
                    <fields>
                        <field>
                            <name>RCFGEN</name>
                            <description>desc RCFGEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCFGLLP</name>
                            <description>desc RCFGLLP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCFGCHS</name>
                            <description>desc RCFGCHS</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SARMD</name>
                            <description>desc SARMD</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DARMD</name>
                            <description>desc DARMD</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNTMD</name>
                            <description>desc CNTMD</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHENCLR</name>
                    <description>desc CHENCLR</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CHENCLR</name>
                            <description>desc CHENCLR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SAR0</name>
                    <description>desc SAR0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DAR0</name>
                    <description>desc DAR0</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTCTL0</name>
                    <description>desc DTCTL0</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPT0</name>
                    <description>desc RPT0</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RPTB0</name>
                    <description>desc RPTB0</description>
                    <alternateRegister>RPT0</alternateRegister>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPTB</name>
                            <description>desc SRPTB</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRPTB</name>
                            <description>desc DRPTB</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTL0</name>
                    <description>desc SNSEQCTL0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNSEQCTLB0</name>
                    <description>desc SNSEQCTLB0</description>
                    <alternateRegister>SNSEQCTL0</alternateRegister>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SNSDIST</name>
                            <description>desc SNSDIST</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNSCNTB</name>
                            <description>desc SNSCNTB</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
