RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB1</name>
            <description>desc EMB</description>
            <baseAddress>0x40017C20</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR1</name>
                <description>EMB Group 1 interrupt</description>
                <value>153</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB2</name>
            <description>desc EMB</description>
            <baseAddress>0x40017C40</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR2</name>
                <description>EMB Group 2 interrupt</description>
                <value>154</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB3</name>
            <description>desc EMB</description>
            <baseAddress>0x40017C60</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR3</name>
                <description>EMB Group 3 interrupt</description>
                <value>155</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB4</name>
            <description>desc EMB</description>
            <baseAddress>0x40017C80</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR4</name>
                <description>EMB Group 4 interrupt</description>
                <value>156</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB5</name>
            <description>desc EMB</description>
            <baseAddress>0x40017CA0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR5</name>
                <description>EMB Group 5 interrupt</description>
                <value>157</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="EMB0">
            <name>EMB6</name>
            <description>desc EMB</description>
            <baseAddress>0x40017CC0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMB_GR6</name>
                <description>EMB Group 6 interrupt</description>
                <value>158</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>EMB_CTL1</name>
            <description>desc EMB_CTL1</description>
            <baseAddress>0x00000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EMB_CTL2</name>
                    <description>desc EMB_CTL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFF0007</resetMask>
                    <fields>
                        <field>
                            <name>PWMLV0</name>
                            <description>desc PWMLV0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV1</name>
                            <description>desc PWMLV1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV2</name>
                            <description>desc PWMLV2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL1</name>
                            <description>desc NFSEL1</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN1</name>
                            <description>desc NFEN1</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL2</name>
                            <description>desc NFSEL2</description>
                            <msb>20</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN2</name>
                            <description>desc NFEN2</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL3</name>
                            <description>desc NFSEL3</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN3</name>
                            <description>desc NFEN3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL4</name>
                            <description>desc NFSEL4</description>
                            <msb>26</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN4</name>
                            <description>desc NFEN4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL5</name>
                            <description>desc NFSEL5</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN5</name>
                            <description>desc NFEN5</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMB_SOE</name>
                    <description>desc EMB_SOE</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>SOE</name>
                            <description>desc SOE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMB_STAT</name>
                    <description>desc EMB_STAT</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7DFEE</resetMask>
                    <fields>
                        <field>
                            <name>PWMSF</name>
                            <description>desc PWMSF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPF</name>
                            <description>desc CMPF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SYSF</name>
                            <description>desc SYSF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWMST</name>
                            <description>desc PWMST</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPST</name>
                            <description>desc CMPST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SYSST</name>
                            <description>desc SYSST</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF1</name>
                            <description>desc PORTINF1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF2</name>
                            <description>desc PORTINF2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF3</name>
                            <description>desc PORTINF3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF4</name>
                            <description>desc PORTINF4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF5</name>
                            <description>desc PORTINF5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST1</name>
                            <description>desc PORTINST1</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST2</name>
                            <description>desc PORTINST2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST3</name>
                            <description>desc PORTINST3</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST4</name>
                            <description>desc PORTINST4</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST5</name>
                            <description>desc PORTINST5</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMB_STATCLR</name>
                    <description>desc EMB_STATCLR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMSFCLR</name>
                            <description>desc PWMSFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMPFCLR</name>
                            <description>desc CMPFCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SYSFCLR</name>
                            <description>desc SYSFCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR1</name>
                            <description>desc PORTINFCLR1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR2</name>
                            <description>desc PORTINFCLR2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR3</name>
                            <description>desc PORTINFCLR3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR4</name>
                            <description>desc PORTINFCLR4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR5</name>
                            <description>desc PORTINFCLR5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMB_INTEN</name>
                    <description>desc EMB_INTEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMSINTEN</name>
                            <description>desc PWMSINTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPINTEN</name>
                            <description>desc CMPINTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSINTEN</name>
                            <description>desc SYSINTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN1</name>
                            <description>desc PORTININTEN1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN2</name>
                            <description>desc PORTININTEN2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN3</name>
                            <description>desc PORTININTEN3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN4</name>
                            <description>desc PORTININTEN4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN5</name>
                            <description>desc PORTININTEN5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMB_RLSSEL</name>
                    <description>desc EMB_RLSSEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMRSEL</name>
                            <description>desc PWMRSEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPRSEL</name>
                            <description>desc CMPRSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSRSEL</name>
                            <description>desc SYSRSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL1</name>
                            <description>desc PORTINRSEL1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL2</name>
                            <description>desc PORTINRSEL2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL3</name>
                            <description>desc PORTINRSEL3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL4</name>
                            <description>desc PORTINRSEL4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL5</name>
                            <description>desc PORTINRSEL5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
