RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PERIC</name>
            <description>desc PERIC</description>
            <baseAddress>0x40055400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USB_SYCTLREG</name>
                    <description>desc USB_SYCTLREG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7003F</resetMask>
                    <fields>
                        <field>
                            <name>USBFS_DFB</name>
                            <description>desc USBFS_DFB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_SOFEN</name>
                            <description>desc USBFS_SOFEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_WKUP</name>
                            <description>desc USBFS_WKUP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_DMPD</name>
                            <description>desc USBFS_DMPD</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_DPPD</name>
                            <description>desc USBFS_DPPD</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_PDEN</name>
                            <description>desc USBFS_PDEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFS</name>
                            <description>desc USBFS_NFS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFE</name>
                            <description>desc USBFS_NFE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC_ENAR</name>
                    <description>desc SMC_ENAR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x2</resetMask>
                    <fields>
                        <field>
                            <name>SMCEN</name>
                            <description>desc SMCEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_SYCTLREG</name>
                    <description>desc CAN_SYCTLREG</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70007</resetMask>
                    <fields>
                        <field>
                            <name>CAN1FDE</name>
                            <description>desc CAN1FDE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2FDE</name>
                            <description>desc CAN2FDE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN3FDE</name>
                            <description>desc CAN3FDE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFS</name>
                            <description>desc USBFS_NFS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFE</name>
                            <description>desc USBFS_NFE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USART1_NFC</name>
                    <description>desc USART1_NFC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>USASRT1_NFS</name>
                            <description>desc USASRT1_NFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1_NFE</name>
                            <description>desc USART1_NFE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
