RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PWC</name>
            <description>desc PWC</description>
            <baseAddress>0x40048000</baseAddress>
            <alternatePeripheral>CMU</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PWC_WKTM</name>
                <description>WKTM compare match interrupt</description>
                <value>73</value>
            </interrupt>
            <interrupt>
                <name>PWC_PVD1</name>
                <description>Programable voltage detect unit 1 interrupt</description>
                <value>168</value>
            </interrupt>
            <interrupt>
                <name>PWC_PVD2</name>
                <description>Programable voltage detect unit 2 interrupt</description>
                <value>169</value>
            </interrupt>
            <registers>
                <register>
                    <name>FCG0</name>
                    <description>desc FCG0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFA0E</resetValue>
                    <resetMask>0x7FFEC11</resetMask>
                    <fields>
                        <field>
                            <name>SRAMH</name>
                            <description>desc SRAMH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM0</name>
                            <description>desc SRAM0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMRET</name>
                            <description>desc SRAMRET</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLA</name>
                            <description>desc PLA</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>desc KEY</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA1</name>
                            <description>desc DMA1</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA2</name>
                            <description>desc DMA2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCM</name>
                            <description>desc FCM</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AOS</name>
                            <description>desc AOS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTC</name>
                            <description>desc CTC</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MAU</name>
                            <description>desc MAU</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AES</name>
                            <description>desc AES</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HASH</name>
                            <description>desc HASH</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNG</name>
                            <description>desc TRNG</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>desc CRC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU1</name>
                            <description>desc DCU1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU2</name>
                            <description>desc DCU2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU3</name>
                            <description>desc DCU3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG1</name>
                    <description>desc FCG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xF4F017F</resetMask>
                    <fields>
                        <field>
                            <name>CAN1</name>
                            <description>desc CAN1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2</name>
                            <description>desc CAN2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN3</name>
                            <description>desc CAN3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>QSPI</name>
                            <description>desc QSPI</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1</name>
                            <description>desc I2C1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2</name>
                            <description>desc I2C2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3</name>
                            <description>desc I2C3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDIO</name>
                            <description>desc MDIO</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1</name>
                            <description>desc SPI1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI2</name>
                            <description>desc SPI2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI3</name>
                            <description>desc SPI3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI4</name>
                            <description>desc SPI4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS</name>
                            <description>desc USBFS</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMAC1</name>
                            <description>desc FMAC1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMAC2</name>
                            <description>desc FMAC2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMAC3</name>
                            <description>desc FMAC3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMAC4</name>
                            <description>desc FMAC4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG2</name>
                    <description>desc FCG2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x3FFB7FF</resetMask>
                    <fields>
                        <field>
                            <name>TMR6_1</name>
                            <description>desc TMR6_1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_2</name>
                            <description>desc TMR6_2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_3</name>
                            <description>desc TMR6_3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_4</name>
                            <description>desc TMR6_4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_5</name>
                            <description>desc TMR6_5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_6</name>
                            <description>desc TMR6_6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_7</name>
                            <description>desc TMR6_7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_8</name>
                            <description>desc TMR6_8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_9</name>
                            <description>desc TMR6_9</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_10</name>
                            <description>desc TMR6_10</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4</name>
                            <description>desc TMR4</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_1</name>
                            <description>desc TMR0_1</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2</name>
                            <description>desc TMR0_2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMB</name>
                            <description>desc EMB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_1</name>
                            <description>desc TMR2_1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_2</name>
                            <description>desc TMR2_2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_3</name>
                            <description>desc TMR2_3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_4</name>
                            <description>desc TMR2_4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_1</name>
                            <description>desc TMRA_1</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_2</name>
                            <description>desc TMRA_2</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_3</name>
                            <description>desc TMRA_3</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_4</name>
                            <description>desc TMRA_4</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_5</name>
                            <description>desc TMRA_5</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_6</name>
                            <description>desc TMRA_6</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
