RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
                <register>
                    <name>STFLR</name>
                    <description>desc STFLR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70007</resetMask>
                    <fields>
                        <field>
                            <name>CMFA</name>
                            <description>desc CMFA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFA</name>
                            <description>desc OVFA</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICPA</name>
                            <description>desc ICPA</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFB</name>
                            <description>desc CMFB</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFB</name>
                            <description>desc OVFB</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICPB</name>
                            <description>desc ICPB</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR21">
            <name>TMR22</name>
            <description>desc TMR2</description>
            <baseAddress>0x40024C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR2_2</name>
                <description>Timer2 unit 2 compare match or input capture interrupt</description>
                <value>65</value>
            </interrupt>
            <interrupt>
                <name>TMR2_2</name>
                <description>Timer2 unit 2 counter overflow interrupt</description>
                <value>66</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR21">
            <name>TMR23</name>
            <description>desc TMR2</description>
            <baseAddress>0x40025000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR2_3</name>
                <description>Timer2 unit 3 compare match or input capture interrupt</description>
                <value>67</value>
            </interrupt>
            <interrupt>
                <name>TMR2_3</name>
                <description>Timer2 unit 3 counter overflow interrupt</description>
                <value>68</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR21">
            <name>TMR24</name>
            <description>desc TMR2</description>
            <baseAddress>0x40025400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR2_4</name>
                <description>Timer2 unit 4 compare match or input capture interrupt</description>
                <value>69</value>
            </interrupt>
            <interrupt>
                <name>TMR2_4</name>
                <description>Timer2 unit 4 counter overflow interrupt</description>
                <value>70</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TMR4</name>
            <description>desc TMR4</description>
            <baseAddress>0x40038000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xEA</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR4_1_GCMP</name>
                <description>Timer4 unit 1 compare match interrupt</description>
                <value>124</value>
            </interrupt>
            <interrupt>
                <name>TMR4_1_OVF_UDF</name>
                <description>Timer4 unit 1 overflow or underflow interrupt</description>
                <value>125</value>
            </interrupt>
            <interrupt>
                <name>TMR4_1_RELOAD</name>
                <description>Timer4 unit 1 reload match interrupt</description>
                <value>126</value>
            </interrupt>
            <interrupt>
                <name>TMR4_1_SCM</name>
                <description>Timer4 unit 1 special compare match interrupt</description>
                <value>127</value>
            </interrupt>
            <registers>
                <register>
                    <name>OCCRUH</name>
                    <description>desc OCCRUH</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCCRUL</name>
                    <description>desc OCCRUL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCCRVH</name>
                    <description>desc OCCRVH</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCCRVL</name>
                    <description>desc OCCRVL</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCCRWH</name>
                    <description>desc OCCRWH</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCCRWL</name>
                    <description>desc OCCRWL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>OCSRU</name>
                    <description>desc OCSRU</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OCEH</name>
                            <description>desc OCEH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCEL</name>
                            <description>desc OCEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCPH</name>
                            <description>desc OCPH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCPL</name>
                            <description>desc OCPL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCIEH</name>
                            <description>desc OCIEH</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCIEL</name>
                            <description>desc OCIEL</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFH</name>
                            <description>desc OCFH</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFL</name>
                            <description>desc OCFL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCERU</name>
                    <description>desc OCERU</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>CHBUFEN</name>
                            <description>desc CHBUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLBUFEN</name>
                            <description>desc CLBUFEN</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MHBUFEN</name>
                            <description>desc MHBUFEN</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MLBUFEN</name>
                            <description>desc MLBUFEN</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMCH</name>
                            <description>desc LMCH</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMCL</name>
                            <description>desc LMCL</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMMH</name>
                            <description>desc LMMH</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMML</name>
                            <description>desc LMML</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCECH</name>
                            <description>desc MCECH</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCECL</name>
                            <description>desc MCECL</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCSRV</name>
                    <description>desc OCSRV</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OCEH</name>
                            <description>desc OCEH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCEL</name>
                            <description>desc OCEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCPH</name>
                            <description>desc OCPH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCPL</name>
                            <description>desc OCPL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCIEH</name>
                            <description>desc OCIEH</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCIEL</name>
                            <description>desc OCIEL</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFH</name>
                            <description>desc OCFH</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFL</name>
                            <description>desc OCFL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCERV</name>
                    <description>desc OCERV</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>CHBUFEN</name>
                            <description>desc CHBUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLBUFEN</name>
                            <description>desc CLBUFEN</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MHBUFEN</name>
                            <description>desc MHBUFEN</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MLBUFEN</name>
                            <description>desc MLBUFEN</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMCH</name>
                            <description>desc LMCH</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMCL</name>
                            <description>desc LMCL</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMMH</name>
                            <description>desc LMMH</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMML</name>
                            <description>desc LMML</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCECH</name>
                            <description>desc MCECH</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCECL</name>
                            <description>desc MCECL</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
