RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F472.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR610</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003E400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_10_GCMP</name>
                <description>Timer6 unit 10 compare match interrupt</description>
                <value>120</value>
            </interrupt>
            <interrupt>
                <name>TMR6_10_OVF_UDF</name>
                <description>Timer6 unit 10 overflow or underflow interrupt</description>
                <value>121</value>
            </interrupt>
            <interrupt>
                <name>TMR6_10_GDTE</name>
                <description>Timer6 unit 10 dead time error interrupt</description>
                <value>122</value>
            </interrupt>
            <interrupt>
                <name>TMR6_1_SCMP</name>
                <description>Timer6 unit 10 special compare match interrupt</description>
                <value>123</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR62</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_2_GCMP</name>
                <description>Timer6 unit 2 compare match interrupt</description>
                <value>82</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_OVF_UDF</name>
                <description>Timer6 unit 2 overflow or underflow interrupt</description>
                <value>83</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_GDTE</name>
                <description>Timer6 unit 2 dead time error interrupt</description>
                <value>84</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_SCMP</name>
                <description>Timer6 unit 2 special compare match interrupt</description>
                <value>85</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR63</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003C800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_3_GCMP</name>
                <description>Timer6 unit 3 compare match interrupt</description>
                <value>87</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_OVF_UDF</name>
                <description>Timer6 unit 3 overflow or underflow interrupt</description>
                <value>88</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_GDTE</name>
                <description>Timer6 unit 3 dead time error interrupt</description>
                <value>89</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_SCMP</name>
                <description>Timer6 unit 3 special compare match interrupt</description>
                <value>90</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR64</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003CC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_4_GCMP</name>
                <description>Timer6 unit 4 compare match interrupt</description>
                <value>93</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_OVF_UDF</name>
                <description>Timer6 unit 4 overflow or underflow interrupt</description>
                <value>94</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_GDTE</name>
                <description>Timer6 unit 4 dead time error interrupt</description>
                <value>95</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_SCMP</name>
                <description>Timer6 unit 4 special compare match interrupt</description>
                <value>96</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR65</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003D000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_5_GCMP</name>
                <description>Timer6 unit 5 compare match interrupt</description>
                <value>99</value>
            </interrupt>
            <interrupt>
                <name>TMR6_5_OVF_UDF</name>
                <description>Timer6 unit 5 overflow or underflow interrupt</description>
                <value>100</value>
            </interrupt>
            <interrupt>
                <name>TMR6_5_GDTE</name>
                <description>Timer6 unit 5 dead time error interrupt</description>
                <value>101</value>
            </interrupt>
            <interrupt>
                <name>TMR6_5_SCMP</name>
                <description>Timer6 unit 5 special compare match interrupt</description>
                <value>102</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR66</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003D400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_6_GCMP</name>
                <description>Timer6 unit 6 compare match interrupt</description>
                <value>104</value>
            </interrupt>
            <interrupt>
                <name>TMR6_6_OVF_UDF</name>
                <description>Timer6 unit 6 overflow or underflow interrupt</description>
                <value>105</value>
            </interrupt>
            <interrupt>
                <name>TMR6_6_GDTE</name>
                <description>Timer6 unit 6 dead time error interrupt</description>
                <value>106</value>
            </interrupt>
            <interrupt>
                <name>TMR6_6_SCMP</name>
                <description>Timer6 unit 6 special compare match interrupt</description>
                <value>107</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR67</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003D800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_7_GCMP</name>
                <description>Timer6 unit 7 compare match interrupt</description>
                <value>108</value>
            </interrupt>
            <interrupt>
                <name>TMR6_7_OVF_UDF</name>
                <description>Timer6 unit 7 overflow or underflow interrupt</description>
                <value>109</value>
            </interrupt>
            <interrupt>
                <name>TMR6_7_GDTE</name>
                <description>Timer6 unit 7 dead time error interrupt</description>
                <value>110</value>
            </interrupt>
            <interrupt>
                <name>TMR6_7_SCMP</name>
                <description>Timer6 unit 7 special compare match interrupt</description>
                <value>111</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR68</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003DC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_8_GCMP</name>
                <description>Timer6 unit 8 compare match interrupt</description>
                <value>112</value>
            </interrupt>
            <interrupt>
                <name>TMR6_8_OVF_UDF</name>
                <description>Timer6 unit 8 overflow or underflow interrupt</description>
                <value>113</value>
            </interrupt>
            <interrupt>
                <name>TMR6_8_GDTE</name>
                <description>Timer6 unit 8 dead time error interrupt</description>
                <value>114</value>
            </interrupt>
            <interrupt>
                <name>TMR6_8_SCMP</name>
                <description>Timer6 unit 8 special compare match interrupt</description>
                <value>115</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR69</name>
            <description>desc TMR6</description>
            <baseAddress>0x4003E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_9_GCMP</name>
                <description>Timer6 unit 9 compare match interrupt</description>
                <value>116</value>
            </interrupt>
            <interrupt>
                <name>TMR6_9_OVF_UDF</name>
                <description>Timer6 unit 9 overflow or underflow interrupt</description>
                <value>117</value>
            </interrupt>
            <interrupt>
                <name>TMR6_9_GDTE</name>
                <description>Timer6 unit 9 dead time error interrupt</description>
                <value>118</value>
            </interrupt>
            <interrupt>
                <name>TMR6_9_SCMP</name>
                <description>Timer6 unit 9 special compare match interrupt</description>
                <value>119</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TMR6_COMMON</name>
            <description>desc TMR6_COMMON</description>
            <baseAddress>0x4003C300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCNTR</name>
                    <description>desc FCNTR</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7777</resetMask>
                    <fields>
                        <field>
                            <name>NOFIENTA</name>
                            <description>desc NOFIENTA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTA</name>
                            <description>desc NOFICKTA</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTB</name>
                            <description>desc NOFIENTB</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTB</name>
                            <description>desc NOFICKTB</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTC</name>
                            <description>desc NOFIENTC</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTC</name>
                            <description>desc NOFICKTC</description>
                            <msb>10</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTD</name>
                            <description>desc NOFIENTD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTD</name>
                            <description>desc NOFICKTD</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTAR</name>
                    <description>desc SSTAR</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF</resetMask>
                    <fields>
                        <field>
                            <name>SSTA1</name>
                            <description>desc SSTA1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA2</name>
                            <description>desc SSTA2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA3</name>
                            <description>desc SSTA3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA4</name>
                            <description>desc SSTA4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA5</name>
                            <description>desc SSTA5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA6</name>
                            <description>desc SSTA6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA7</name>
                            <description>desc SSTA7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA8</name>
                            <description>desc SSTA8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA9</name>
                            <description>desc SSTA9</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA10</name>
                            <description>desc SSTA10</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTPR</name>
                    <description>desc SSTPR</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF</resetMask>
                    <fields>
                        <field>
                            <name>SSTP1</name>
                            <description>desc SSTP1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP2</name>
                            <description>desc SSTP2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP3</name>
                            <description>desc SSTP3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP4</name>
                            <description>desc SSTP4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP5</name>
                            <description>desc SSTP5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP6</name>
                            <description>desc SSTP6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP7</name>
                            <description>desc SSTP7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP8</name>
                            <description>desc SSTP8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP9</name>
                            <description>desc SSTP9</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP10</name>
                            <description>desc SSTP10</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
